# format을 사용
print("%d-%5d-%05d"%(123,123,123))
print("{0:d}-{1:5d}-{2:05d})".format(123,123,123))
print("{}-{}-{}".format(123,123,123))
print("{}-{}-{}".format(1,3.14,"안녕"))

print("{}+{}={}".format(1,2,1+2))

print("{} {}".format(1,2,3))
# print("{} {} {}". format(1,2))

# 강제 행나누기, 강제 띄어쓰기
print("오늘은 날씨가 흐림. 내일은 날씨가 맑음")
#print("%f"123.45)
print("%d"%123.45)
# 소숫점을 포함해서 총 7자리 출력
# 빈 공백으로 채움. 소숫점이하는 1자리까지 표현
print("%7.1f"%123.45)
# 소숫점이하는 3자리로 표현하고 빈공백은 0으로 채움
print("07.3f"%123.45)

# 문자열은 %s를 사용
print("안녕하세요")
print("%s"%"반갑습니다")

# 문자는 %c

print("%.2f"%758.12345678)
print("%10d"%25.05)
print("%d"%150.15)
print("%f"%150.15)
print("%s"%150.15)
print("*"*10)
